InformationRegisters/ЛБ_РеестрБезначныхПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_РеестрБезначныхПлатежей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусПлатежа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СтатусыБезналичныхПлатежей</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплатаПроценты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОплатаЗайм</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Переплата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Возврат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗалоговыйБилет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИОЗаемщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИОПлательщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОплаты</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацияПоЗалогу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтменаСотрудникомЦО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РеестрПлатежей</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_РеестрПлатежей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СуммаПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonForms/ЛБ_ИсторияБезналичногоПлатежа/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("РеестрПлатежей") Тогда
		РеестрПлатежей = Параметры.РеестрПлатежей;
	КонецЕсли;	
	Если Параметры.Свойство("НомерЗБ") Тогда
		НомерЗБ = Параметры.НомерЗБ;
	КонецЕсли;	 
	Если Параметры.Свойство("ДатаПлатежа") Тогда
		ДатаПлатежа = Параметры.ДатаПлатежа;
	КонецЕсли;	 
	Если Параметры.Свойство("ИдентификаторПлатежа") Тогда
		ИдентификаторПлатежа = Параметры.ИдентификаторПлатежа;
	КонецЕсли;	 
	Если Параметры.Свойство("СуммаПлатежа") Тогда
		СуммаПлатежа = Параметры.СуммаПлатежа;
	КонецЕсли;	 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	Если НЕ ЗначениеЗаполнено(РеестрПлатежей) Тогда
		Предупреждение("Не выбран реестр платежей!", 60);
		Отказ = Истина;
	КонецЕсли;  
	ВывестиИсторию();
КонецПроцедуры

&НаСервере
Процедура ВывестиИсторию()  
	Элементы.ДекорацияПлатеж.Заголовок = СокрЛП(РеестрПлатежей.НомерРеестра) + " от " + Формат(РеестрПлатежей.Дата, "ДФ=dd.MM.yyyy") + "," +
	    Символы.ПС + "Платеж № " + СокрЛП(ИдентификаторПлатежа) + " от " + формат(ДатаПлатежа, "ДЛФ=DT") + " на сумму " + СокрЛП(Формат(СуммаПлатежа, "ЧЦ=15; ЧДЦ=2")) + " руб.," +
		Символы.ПС + "Залоговый билет № " + СокрЛП(НомерЗБ);
	Запрос = новый Запрос;    
	Запрос.УстановитьПараметр("РеестрПлатежей", РеестрПлатежей);  
	Запрос.УстановитьПараметр("ДатаПлатежа", ДатаПлатежа);
	Запрос.УстановитьПараметр("ИдентификаторПлатежа", ИдентификаторПлатежа);
	Запрос.УстановитьПараметр("НомерЗБ", НомерЗБ);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВЫБОР
	               |		КОГДА ЛБ_РеестрБезначныхПлатежей.ОтменаСотрудникомЦО
	               |			ТОГДА ""Отмена операции сотрудником ЦО""
	               |		ИНАЧЕ ЛБ_РеестрБезначныхПлатежей.СтатусПлатежа
	               |	КОНЕЦ КАК СтатусПлатежа,
	               |	ЛБ_РеестрБезначныхПлатежей.Ответственный КАК Ответственный,
	               |	ЛБ_РеестрБезначныхПлатежей.Период КАК Дата,
	               |	ВЫБОР
	               |		КОГДА ЛБ_РеестрБезначныхПлатежей.НомерЗБ = ЛБ_РеестрБезначныхПлатежей.ЗалоговыйБилет.НомерЗалоговогоБилета
	               |			ТОГДА """"
	               |		ИНАЧЕ ЛБ_РеестрБезначныхПлатежей.ЗалоговыйБилет.НомерЗалоговогоБилета
	               |	КОНЕЦ КАК НомерЗБНовый
	               |ИЗ
	               |	РегистрСведений.ЛБ_РеестрБезначныхПлатежей КАК ЛБ_РеестрБезначныхПлатежей
	               |ГДЕ
	               |	ЛБ_РеестрБезначныхПлатежей.РеестрПлатежей = &РеестрПлатежей
	               |	И ЛБ_РеестрБезначныхПлатежей.НомерЗБ = &НомерЗБ
	               |	И ЛБ_РеестрБезначныхПлатежей.ДатаПлатежа = &ДатаПлатежа
	               |	И ЛБ_РеестрБезначныхПлатежей.ИдентификаторПлатежа = &ИдентификаторПлатежа
	               |	И НЕ ЛБ_РеестрБезначныхПлатежей.Регистратор = &РеестрПлатежей
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата УБЫВ";
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
   	ИсторияИзменений.Загрузить(ТаблицаЗапроса);
КонецПроцедуры
